---
kind: type
id: T:Autodesk.Revit.DB.DisplayUnit
source: html/54e413c9-ad34-f744-6b7e-c1f90cbbde46.htm
---
# Autodesk.Revit.DB.DisplayUnit

Describes the type of Revit display unit, metric or imperial.

## Syntax (C#)
```csharp
public enum DisplayUnit
```